---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalResourceLoadContext
source: html/72b406e4-b72e-5858-3f0f-b2ab09cba984.htm
---
# ExternalResourceLoadContext Properties

Specifies whether the .NET object represents a valid Revit entity.